Revit 2024 API
StairsNumberSystemReferenceOption Enumeration
 The reference types permitted for a number system to refer to the geometry of a stairs run.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum StairsNumberSystemReferenceOption
Visual Basic
Public Enumeration StairsNumberSystemReferenceOption
Visual C++
public enum class StairsNumberSystemReferenceOption
Members
Member name | Description
Center |  The number system reference to stairs path.
Left |  The number system reference to left boundary of stairs.
Right |  The number system reference to right boundary of stairs.
LeftQuarter |  The number system reference to left quarter of stairs
RightQuarter |  The number system reference to right quarter of stairs
See Also
Autodesk.Revit.DB.Architecture Namespace